#  Maji Mdogo Integrated Project Part II

#  Clustering data to unveil Maji Ndogo's water crisis

In [121]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [122]:
%sql mysql+pymysql://root:pass45@localhost:3306/md_water_services

In [123]:
%%sql

SELECT
*
FROM
employee
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[(0, 'Amara Jengo', '+99637993287', 'amara.jengo@ndogowater.gov', '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786', 'bello.azibo@ndogowater.gov', '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041', 'bakari.iniko@ndogowater.gov', '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (3, 'Malachi Mavuso', '+99945849900', 'malachi.mavuso@ndogowater.gov', '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Surveyor'),
 (4, 'Cheche Buhle', '+99381679640', 'cheche.buhle@ndogowater.gov', '1 Savanna Street', 'Akatsi', 'Rural', 'Field Surveyor')]

# 1.Cleaning the Data
1.1 First update the emaill column since its null  by using this formart: first_name.last_name@ndogowater.gov.
 Step to follow to  determine the email address for each employee:
- selecting the employee_name column
- replacing the space with a full stop
- make it lowercase
- and stitch it all together
  And since we have the column we just need to use update and set to change the column

In [7]:
%%sql

UPDATE employee
SET email = CONCAT(LOWER(REPLACE(employee_name,' ', '.')), '@ndogowater.gov');

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
56 rows affected.

[]

1. b) Remove the space in the phone number column to ensure the characters are 12

In [124]:
%%sql

UPDATE employee
SET phone_number = TRIM(phone_number);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
56 rows affected.

[]

# 2. Honouring the workers

2 a) Number of Employees in each city

In [125]:
%%sql

SELECT 
town_name,
COUNT(employee_name) AS Number_of_employees
FROM 
employee
GROUP BY town_name;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
9 rows affected.

[('Ilanga', 3),
 ('Rural', 29),
 ('Lusaka', 4),
 ('Zanzibar', 4),
 ('Dahabu', 6),
 ('Kintampo', 1),
 ('Harare', 5),
 ('Yaounde', 1),
 ('Serowe', 3)]

b)Employees with most visits

Here we first use the the visits table to find the number of visits per employee then order them to get with the highest count.

In [126]:
%%sql

SELECT
assigned_employee_id,
COUNT(visit_count) As Number_of_Visits
FROM
visits
GROUP BY assigned_employee_id
ORDER BY Number_of_Visits DESC
limit 3;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
3 rows affected.

[(1, 3708), (30, 3676), (34, 3539)]

Here we use the assigned id we got from the visits table to get the name,email and phone number of the top three emloyees from the employee table

In [127]:
%%sql

SELECT 
employee_name,
Phone_number,
email
FROM
employee
WHERE assigned_employee_id IN (1, 30 , 34 );

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
3 rows affected.

[('Bello Azibo', '+99643864786', 'bello.azibo@ndogowater.gov'),
 ('Pili Zola', '+99822478933', 'pili.zola@ndogowater.gov'),
 ('Rudo Imani', '+99046972648', 'rudo.imani@ndogowater.gov')]

# 3.Analysing locations

3. a) count the number of records for each town

In [10]:
%%sql

SELECT
COUNT(*) AS Records_per_town,
Town_name
FROM 
location
GROUP BY Town_name
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[(1650, 'Harare'),
 (780, 'Kintampo'),
 (1070, 'Lusaka'),
 (23740, 'Rural'),
 (400, 'Abidjan'),
 (1090, 'Amina'),
 (930, 'Asmara'),
 (400, 'Bello'),
 (930, 'Dahabu'),
 (520, 'Pwani')]

b) Now count the records per province.

In [12]:
%%sql

SELECT
COUNT(*) AS Records_per_province,
province_name
FROM
location
GROUP BY province_name;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[(8940, 'Akatsi'),
 (6950, 'Amanzi'),
 (6030, 'Hawassa'),
 (9510, 'Kilimani'),
 (8220, 'Sokoto')]


c)Create a result set showing:
• province_name
• town_name
• An aggregated count of records for each town (consider naming this records_per_town).
• Ensure your data is grouped by both province_name and town_name.
 Order your results primarily by province_name. Within each province, further sort the towns by their record counts in descending order.

In [128]:
%%sql

SELECT
province_name,
town_name,
COUNT(*) AS Records_per_town
FROM 
location
GROUP BY
province_name, town_name
ORDER BY
province_name ASC, Records_per_town DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('Akatsi', 'Rural', 6290),
 ('Akatsi', 'Lusaka', 1070),
 ('Akatsi', 'Harare', 800),
 ('Akatsi', 'Kintampo', 780),
 ('Amanzi', 'Rural', 3100)]

c)look at the number of records for each location type

In [14]:
%%sql
SELECT
location_type,
COUNT(*) AS Records_per_location_type
FROM
location
GROUP BY
location_type;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
2 rows affected.

[('Urban', 15910), ('Rural', 23740)]

# Diving into the sources
Water sources table

In [129]:
%%sql

SELECT
*
FROM 
water_source
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('AkHa00000224', 'tap_in_home', 956),
 ('AkHa00001224', 'tap_in_home_broken', 930),
 ('AkHa00002224', 'tap_in_home_broken', 486),
 ('AkHa00003224', 'well', 364),
 ('AkHa00004224', 'tap_in_home_broken', 942)]

a)How many people did we survey in total?

In [19]:
%%sql
SELECT
SUM(number_of_people_served) AS Total_people_surveyed
FROM
water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(Decimal('27628140'),)]

In [ ]:
b)count how many of each of the different water source types there are

In [21]:
%%sql
SELECT
type_of_water_source,
COUNT(type_of_water_source) AS Number_of_each_source
FROM
water_source
GROUP BY type_of_water_source;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('tap_in_home', 7265),
 ('tap_in_home_broken', 5856),
 ('well', 17383),
 ('shared_tap', 5767),
 ('river', 3379)]

In [ ]:
c)the average number of people that are served by each water

In [130]:
%%sql
SELECT
type_of_water_source,
COUNT(type_of_water_source) AS Number_of_each_source,
ROUND(AVG(number_of_people_served)) AS avg_people_per_source
FROM
water_source
GROUP BY type_of_water_source
HAVING type_of_water_source LIKE "%tap%";

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
3 rows affected.

[('tap_in_home', 7265, Decimal('644')),
 ('tap_in_home_broken', 5856, Decimal('649')),
 ('shared_tap', 5767, Decimal('2071'))]

In [119]:
%%sql
SELECT
SUM(number_of_people_served) AS population_served
FROM
water_source

ORDER BY
population_served;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(Decimal('27628140'),)]

calculate the total number of people served by each type of water source in total

In [32]:
%%sql
SELECT
type_of_water_source,
COUNT(type_of_water_source) AS Number_of_each_source,
SUM(number_of_people_served) AS Total_number_of_people_served,
ROUND(SUM(number_of_people_served)/27628140*100) AS Pct_number_of_people_served
FROM
water_source
GROUP BY type_of_water_source
ORDER BY Total_number_of_people_served DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('shared_tap', 5767, Decimal('11945272'), Decimal('43')),
 ('well', 17383, Decimal('4841724'), Decimal('18')),
 ('tap_in_home', 7265, Decimal('4678880'), Decimal('17')),
 ('tap_in_home_broken', 5856, Decimal('3799720'), Decimal('14')),
 ('river', 3379, Decimal('2362544'), Decimal('9'))]

# 5.Start of a solution

Rank the water sources that serve the people of maji ndogo

In [40]:
%%sql
SELECT
type_of_water_source,
COUNT(type_of_water_source) AS Number_of_each_source,
SUM(number_of_people_served) AS Total_number_of_people_served,
ROUND(SUM(number_of_people_served)/27628140*100) AS Pct_number_of_people_served,
RANK() OVER (ORDER BY SUM(number_of_people_served) DESC) AS Rank_Pop
FROM
water_source
GROUP BY type_of_water_source
ORDER BY Total_number_of_people_served DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
5 rows affected.

[('shared_tap', 5767, Decimal('11945272'), Decimal('43'), 1),
 ('well', 17383, Decimal('4841724'), Decimal('18'), 2),
 ('tap_in_home', 7265, Decimal('4678880'), Decimal('17'), 3),
 ('tap_in_home_broken', 5856, Decimal('3799720'), Decimal('14'), 4),
 ('river', 3379, Decimal('2362544'), Decimal('9'), 5)]

Rank

In [82]:
%%sql
SELECT
source_id,
type_of_water_source, 
number_of_people_served, 
DENSE_RANK() OVER ( ORDER BY number_of_people_served DESC) AS priority_rank
FROM
water_source
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[('HaRu19509224', 'shared_tap', 3998, 1),
 ('AkRu05603224', 'shared_tap', 3998, 1),
 ('AkRu04862224', 'shared_tap', 3996, 2),
 ('KiHa22867224', 'shared_tap', 3996, 2),
 ('AmAs10911224', 'shared_tap', 3996, 2),
 ('HaRu19839224', 'shared_tap', 3994, 3),
 ('KiZu31330224', 'shared_tap', 3994, 3),
 ('KiZu31415224', 'shared_tap', 3992, 4),
 ('KiRu28630224', 'shared_tap', 3992, 4),
 ('KiRu26218224', 'shared_tap', 3990, 5)]

# 6. Analysing queues.

a) To calculate how long the survey took, we need to get the first and last dates (which functions can find the largest/smallest value), and subtract
them. Remember with DateTime data, we can't just subtract the values. We have to use a function to get the difference in days.

In [63]:
%%sql
SELECT
MIN(time_of_record) AS First_day_of_survey,
MAX(time_of_record) AS Last_day_of_survey,
DATEDIFF('2023-07-14 13:53:00', '2021-01-01 09:10:00') AS Total_days_the_survey_took
FROM 
visits;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(datetime.datetime(2021, 1, 1, 9, 10), datetime.datetime(2023, 7, 14, 13, 53), 924)]

b) Let's see how long people have to queue on average in Maji Ndogo. Keep in mind that many sources like taps_in_home have no queues. These
are just recorded as 0 in the time_in_queue column, so when we calculate averages, we need to exclude those rows. Try using NULLIF() do to
this.

In [65]:
%%sql
SELECT
ROUND(AVG(NULLIF(time_in_queue, 0))) AS Avg_time_in_queue
FROM
visits;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
1 rows affected.

[(Decimal('123'),)]

c) So let's look at the queue times aggregated across the different days of the week.
To do this, we need to calculate the average queue time, grouped by day of the week. Remember to revise DateTime functions, and also think
about how to present the results clearly.

In [85]:
%%sql
SELECT
DAYNAME(time_of_record) AS day_of_week,
ROUND(AVG(NULLIF(time_in_queue, 0))) AS Avg_time_in_queue
FROM
visits
GROUP BY day_of_week;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
7 rows affected.

[('Friday', Decimal('120')),
 ('Saturday', Decimal('246')),
 ('Sunday', Decimal('82')),
 ('Monday', Decimal('137')),
 ('Tuesday', Decimal('108')),
 ('Wednesday', Decimal('97')),
 ('Thursday', Decimal('105'))]

d) We can also look at what time during the day people collect water. Try to order the results in a meaningful way.

In [81]:
%%sql
SELECT
TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
ROUND(AVG(time_in_queue)) AS Avg_time_in_queue
FROM
visits
GROUP BY hour_of_day
ORDER BY  hour_of_day;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
14 rows affected.

[('06:00', Decimal('149')),
 ('07:00', Decimal('149')),
 ('08:00', Decimal('149')),
 ('09:00', Decimal('49')),
 ('10:00', Decimal('48')),
 ('11:00', Decimal('46')),
 ('12:00', Decimal('47')),
 ('13:00', Decimal('47')),
 ('14:00', Decimal('47')),
 ('15:00', Decimal('48')),
 ('16:00', Decimal('47')),
 ('17:00', Decimal('149')),
 ('18:00', Decimal('147')),
 ('19:00', Decimal('168'))]

e) the queue times for each day, hour by hour

In [88]:
%%sql
SELECT
TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue
ELSE NULL
END
),0) AS Sunday,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue
ELSE NULL
END
),0) AS Monday,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Tuesday' THEN time_in_queue
ELSE NULL
END
),0) AS Tuesday,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Wednesday' THEN time_in_queue
ELSE NULL
END
),0) AS Wednesday,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Thursday' THEN time_in_queue
ELSE NULL
END
),0) AS Thursdayz,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Friday' THEN time_in_queue
ELSE NULL
END
),0) AS Friday,
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Saturday' THEN time_in_queue
ELSE NULL
END
),0) AS Saturday
FROM
visits
WHERE
time_in_queue != 0 
GROUP BY
hour_of_day
ORDER BY
hour_of_day;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
   mysql+pymysql://root:***@localhost:3306/united_nations
14 rows affected.

[('06:00', Decimal('79'), Decimal('190'), Decimal('134'), Decimal('112'), Decimal('134'), Decimal('153'), Decimal('247')),
 ('07:00', Decimal('82'), Decimal('186'), Decimal('128'), Decimal('111'), Decimal('139'), Decimal('156'), Decimal('247')),
 ('08:00', Decimal('86'), Decimal('183'), Decimal('130'), Decimal('119'), Decimal('129'), Decimal('153'), Decimal('247')),
 ('09:00', Decimal('84'), Decimal('127'), Decimal('105'), Decimal('94'), Decimal('99'), Decimal('107'), Decimal('252')),
 ('10:00', Decimal('83'), Decimal('119'), Decimal('99'), Decimal('89'), Decimal('95'), Decimal('112'), Decimal('259')),
 ('11:00', Decimal('78'), Decimal('115'), Decimal('102'), Decimal('86'), Decimal('99'), Decimal('104'), Decimal('236')),
 ('12:00', Decimal('78'), Decimal('115'), Decimal('97'), Decimal('88'), Decimal('96'), Decimal('109'), Decimal('239')),
 ('13:00', Decimal('81'), Decimal('122'), Decimal('97'), Decimal('98'), Decimal('101'), Decimal('115'), Decimal('242')),
 ('14:00', Decimal('83'), Decimal('127'), Decimal('104'), Decimal('92'), Decimal('96'), Decimal('110'), Decimal('244')),
 ('15:00', Decimal('83'), Decimal('126'), Decimal('104'), Decimal('88'), Decimal('92'), Decimal('110'), Decimal('248')),
 ('16:00', Decimal('83'), Decimal('127'), Decimal('99'), Decimal('90'), Decimal('99'), Decimal('109'), Decimal('251')),
 ('17:00', Decimal('79'), Decimal('181'), Decimal('135'), Decimal('121'), Decimal('129'), Decimal('151'), Decimal('251')),
 ('18:00', Decimal('80'), Decimal('174'), Decimal('122'), Decimal('113'), Decimal('132'), Decimal('158'), Decimal('240')),
 ('19:00', Decimal('127'), Decimal('159'), Decimal('145'), Decimal('176'), Decimal('137'), Decimal('103'), Decimal('282'))]